<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"287ad532dbed66dc01ed739f7c486da423beb2849b952991ca03debdb7af9239","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #952 at https://github.com/cal-itp/data-infra/actions/runs/19241387036","plan_out_hash":"893a5c697d53a399fdb9e76f12363ce0b50c541bbf52c4771e4329d1d788a929","plan_hash":"e57387e6d9041ae563dfa92dbdea7e68e2fa158ff872bbd1a26617191bda6dd5","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-staging-composer["plugins/operators/gcs_to_ckan_operator.py"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer" {
!~      crc32c              = "8BBB2Q==" -> (known after apply)
!~      detect_md5hash      = "acBkOjluXjOyhdfmLuIIdQ==" -> "different hash"
!~      generation          = 1762797746276212 -> (known after apply)
        id                  = "calitp-staging-composer-plugins/operators/gcs_to_ckan_operator.py"
!~      md5hash             = "acBkOjluXjOyhdfmLuIIdQ==" -> (known after apply)
        name                = "plugins/operators/gcs_to_ckan_operator.py"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "+J6yaA==" -> (known after apply)
!~      detect_md5hash      = "3qcwGr94eCDjtzj/M3jbpA==" -> "different hash"
!~      generation          = 1762539328304653 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "3qcwGr94eCDjtzj/M3jbpA==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-staging-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-staging-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "Ocwiww==" -> (known after apply)
!~      detect_md5hash      = "cmJFSimTWqd/cbYqqkr/JQ==" -> "different hash"
!~      generation          = 1762539330090157 -> (known after apply)
        id                  = "calitp-staging-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "cmJFSimTWqd/cbYqqkr/JQ==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #952](https://github.com/cal-itp/data-infra/actions/runs/19241387036)